tap "anomalyco/tap"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "largemodgames/spotatui", "https://github.com/LargeModGames/homebrew-spotatui"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "pgplex/pgschema"
tap "potatolabs/git-redate"
tap "railwaycat/emacsmacport"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Golang formatter that fixes long lines
brew "golines"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Post-modern modal text editor
brew "helix"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open-source, cross-platform JavaScript runtime environment
brew "node@24"
# Libraries for security-enabled client and server applications
brew "nss"
# Interactive GPU process monitor
brew "nvtop"
# Programming language with focus on simplicity, performance and modern systems
brew "odin"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@17"
# Diff Postgres schemas and generating SQL migrations
brew "pg-schema-diff"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Develop and deploy code with zero configuration
brew "railway"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Zsh prompt for Astronauts
brew "spaceship"
# Generate type safe Go from SQL
brew "sqlc"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Open source IDE for exploring and testing APIs
cask "bruno"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
cask "font-google-sans-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-sauce-code-pro-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GPU-based terminal emulator
cask "kitty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
go "github.com/air-verse/air"
go "github.com/codesenberg/bombardier"
go "github.com/bootdotdev/bootdev"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/aecsar/drift"
go "fyne.io/tools/cmd/fyne"
go "github.com/aecsar/go-backend"
go "github.com/nicksnyder/go-i18n/v2/goi18n"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/rebelice/lazypg/cmd/lazypg"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "go.uber.org/nilaway/cmd/nilaway"
go "github.com/aecsar/passgen"
go "github.com/pgplex/pgschema"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
go "github.com/ashish0kumar/typtea"
uv "posting"
npm "pnpm"
