tap "mongodb/brew"
tap "nikitabobko/tap"
tap "potatolabs/git-redate"
brew "cloc"
brew "diff-so-fancy"
brew "fd"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "go@1.24"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "golines"
brew "hadolint"
brew "helix"
brew "lazygit"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "spotify_player"
brew "sqlc"
brew "starship"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "mongodb/brew/mongodb-community"
brew "potatolabs/git-redate/git-redate"
cask "expo-orbit"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "ghostty"
cask "kitty"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "aki77.rails-routes"
vscode "aliariff.auto-add-brackets"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "antfu.goto-alias"
vscode "antfu.iconify"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cheeky-pixel.flutter-wings"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "codereviewer14.cyber77-vscode"
vscode "codingyu.laravel-goto-view"
vscode "continue.continue"
vscode "csalmeida.summercamp"
vscode "csstools.postcss"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "damms005.devdb"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-theme"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "glenn2223.live-sass"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hermitter.oh-lucy-vscode"
vscode "humao.rest-client"
vscode "ionutvmi.path-autocomplete"
vscode "jaakko.black"
vscode "jannchie.codetime"
vscode "johnpapa.vscode-peacock"
vscode "keifererikson.nightfox"
vscode "keksiqc.idx-monospace-theme"
vscode "kingwl.restart-your-ts-server"
vscode "leizongmin.node-module-intellisense"
vscode "maosantaella.night-wolf"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikaelkristiansson87.react-theme-vscode"
vscode "mongodb.mongodb-vscode"
vscode "mrmlnc.vscode-autoprefixer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mvllow.rose-pine"
vscode "mylesmurphy.prettify-ts"
vscode "neotan.vscode-auto-restart-typescript-eslint-servers"
vscode "nuxt.mdc"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-extension-pack"
vscode "oven.bun-vscode"
vscode "pgl.laravel-jump-controller"
vscode "phind.phind"
vscode "phproberto.vscode-php-getters-setters"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qvtec3.swagger-php-annotation"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "skyboost.nuxt-3-goto"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tonybaloney.vscode-pets"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vercel.turbo-vsc"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wicked-labs.wvsc-serendipity"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "wscats.vue"
vscode "xdebug.php-debug"
vscode "ybaumes.highlight-trailing-white-spaces"
