tap "anomalyco/tap"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "largemodgames/spotatui"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "pgplex/pgschema"
tap "potatolabs/git-redate"
tap "railwaycat/emacsmacport"
brew "bat"
brew "btop"
brew "cloc"
brew "cocoapods"
brew "php"
brew "composer"
brew "coreutils"
brew "deno"
brew "diff-so-fancy"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flyctl"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "go@1.24"
brew "golines"
brew "hadolint"
brew "helix"
brew "node"
brew "jupyterlab"
brew "lazydocker"
brew "lazygit"
brew "lefthook"
brew "minikube"
brew "mkcert"
brew "neofetch"
brew "neovim"
brew "node@24"
brew "nss"
brew "openjdk"
brew "openjdk@17"
brew "pg-schema-diff"
brew "protobuf"
brew "railway"
brew "ripgrep"
brew "spaceship"
brew "sqlc"
brew "starship"
brew "stow"
brew "tmux"
brew "tree-sitter-cli"
brew "watch"
brew "watchexec"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "bufbuild/buf/buf"
brew "charmbracelet/tap/crush"
brew "largemodgames/spotatui/spotatui"
brew "mongodb/brew/mongodb-community"
brew "potatolabs/git-redate/git-redate"
cask "bruno"
cask "copilot-cli"
cask "expo-orbit"
cask "font-google-sans-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-sauce-code-pro-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "kitty"
cask "ngrok"
cask "warp"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "aliariff.auto-add-brackets"
vscode "antfu.iconify"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "bung87.vscode-gemfile"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cheeky-pixel.flutter-wings"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codereviewer14.cyber77-vscode"
vscode "continue.continue"
vscode "csalmeida.summercamp"
vscode "csstools.postcss"
vscode "cweijan.vscode-mysql-client2"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "dotenv.dotenv-vscode"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-theme"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hermitter.oh-lucy-vscode"
vscode "humao.rest-client"
vscode "inlang.vs-code-extension"
vscode "ionutvmi.path-autocomplete"
vscode "jairochabr.svg-to-react"
vscode "jannchie.codetime"
vscode "keifererikson.nightfox"
vscode "keksiqc.idx-monospace-theme"
vscode "laravel.vscode-laravel"
vscode "m1guelpf.better-pest"
vscode "maosantaella.night-wolf"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-autoprefixer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mvllow.rose-pine"
vscode "mylesmurphy.prettify-ts"
vscode "neotan.vscode-auto-restart-typescript-eslint-servers"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "roipoussiere.tidal-strudel"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "skyboost.nuxt-3-goto"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vercel.turbo-vsc"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wicked-labs.wvsc-serendipity"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "github.com/codesenberg/bombardier"
go "github.com/bootdotdev/bootdev"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/aecsar/drift"
go "fyne.io/tools/cmd/fyne"
go "github.com/aecsar/go-backend"
go "github.com/nicksnyder/go-i18n/v2/goi18n"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/rebelice/lazypg/cmd/lazypg"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "go.uber.org/nilaway/cmd/nilaway"
go "github.com/aecsar/passgen"
go "github.com/pgplex/pgschema"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
go "github.com/ashish0kumar/typtea"
uv "posting"
npm "pnpm"
